{"class_name": "Functional", "config": {"name": "model_1", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8], "dtype": "float32", "sparse": false, "ragged": false, "name": "inputs"}, "name": "inputs", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "FC1", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "FC1", "inbound_nodes": [[["inputs", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BC1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BC1", "inbound_nodes": [[["FC1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Activation1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Activation1", "inbound_nodes": [[["BC1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Dropout1", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "Dropout1", "inbound_nodes": [[["Activation1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "FC2", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "FC2", "inbound_nodes": [[["Dropout1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BC2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BC2", "inbound_nodes": [[["FC2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "Activation2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "Activation2", "inbound_nodes": [[["BC2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Dropout2", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "Dropout2", "inbound_nodes": [[["Activation2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "FC3", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "FC3", "inbound_nodes": [[["Dropout2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "BC3", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "BC3", "inbound_nodes": [[["FC3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Dropout3", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "Dropout3", "inbound_nodes": [[["BC3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "OutLayer", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "OutLayer", "inbound_nodes": [[["Dropout3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "sigmoid", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "sigmoid", "inbound_nodes": [[["OutLayer", 0, 0, {}]]]}], "input_layers": [["inputs", 0, 0]], "output_layers": [["sigmoid", 0, 0]]}, "keras_version": "2.12.0", "backend": "tensorflow"}